# . - один любой символ,кроме строки \n
# ? - 0 или 1 вхождение шаблона слева
# + - 1 і більше входжень шаблону зліва
# * - 0 і більше входжень шаблону зліва
# \w - будь-яка цифра або буква [a-zA-Z0-9_] (\W - все, крім букви або цифри [^a-zA-Z0-9_])
# \d - будь-яка цифра [0-9] (\D - все, крім цифри [^0-9])
# \s - будь-який символ пробілу [\t\n\r\f\v] (\S - все, крім не пробельного символу [^\t\n\r\f\v])
# \ b - межа слова
# [..] - один із символів у дужках ([^..] - будь-який символ, крім тих, що у дужках)
# \ - екранування спец.символів (приклад: \. - означає точку або \+ - знак "плюс")
# ^ і $ - початок і кінець рядка відповідно
# {n,m} - від n до m входжень (приклад: {,m} - від 0 до m)
# a|b - відповідає a або b
# () - групує вираз і повертає знайдений текст
# \t, \n, \r - символ табуляції, нового рядка та повернення каретки

"""
Useful resources
https://ihateregex.io/expr/phone
https://regex101.com/
"""

'''
Метод: search
'''

import re

string = "Файли програми CorelDraw мають розширення .cdr." \
         " Формат cdr кожної нової версії несумісний із старішими версіями, що означає, наприклад," \
         " файл, збережений у версії CorelDraw 9 може бути відкритий в більш новій версії програми" \
         " (CorelDraw 10, 11, 12 і т. д.), але не може бути відкритий в старій версії програми" \
         " (CorelDraw 8, 7, 6 і т. д.)."


pattern = r'[0-9]+'
result = re.search(pattern, string)
print(result.span())
fi, li = result.span()
print(string[fi:li])
print(result.group())

phone_storage = ["380669640547", "0637306465 ", " 380961935171", "632643973", "050832520 ",
                 "000000000", "48730283918", "986223575", "375297947963", "+38(050)123-32-34", "38(050)123 32 34",
                 "38(050)123 32 3b"]
result = re.search(r'^[\+]?[(]?[0-9]{3}[)]?[-\s\.]?[0-9]{3}[-\s\.]?[0-9]{4,6}$', phone_storage[0])